// Напишите программу которая на вход будет принимать 
// число больше 10, и выдает его квадрат

Console.Write("Please put 2 number");
int numberA = int.Parse(Console.ReadLine());
int numberB = int.Parse(Console.ReadLine());

if (numberB * numberB == numberA){
Console.WriteLine("Yes");
}

else
Console.WriteLine("No");

